<template>
    <h2 class="unbounded text-5xl mb-default font-bold mt-section">шаг 1</h2>
    <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-container">
        <div class="bg-primary card shadow-default">
            <div class="flex justify-center items-center gap-default text-white size-30px">
                <img src="~/assets/icons/step_thunder.svg" alt="" />
                Проводим тренинг
            </div>
            <img src="~/assets/images/training.png" alt="" />
            <span class="text-white size-20px">
                Первым делом проводим тренинг для сотрудников по перечисленным темам. Это теоретическая и практическая
                база, которая ляжет в основу роста показателей продаж.
            </span>
            <div class="flex-grow" />
            <div>
                <div class="flex justify-between flex-wrap">
                    <div v-for="chip in chips" class="chip">
                        {{ chip }}
                    </div>
                </div>
                <m-btn
                    label="Оставить заявку на тренинг"
                    icon-right="arrow_forward"
                    color="white"
                    text-color="primary"
                    full-width
                    large
                />
            </div>
        </div>
        <div class="bg-white card shadow-default">
            <h3 class="size-30px text-center">Методы продаж</h3>
            <Accordion v-model="sellMethodsModel" :items="sellMethodsItems" />
        </div>
        <div class="flex flex-col gap-container">
            <div class="bg-white card shadow-default">
                <h3 class="size-30px text-center">Инструменты продаж</h3>
                <Accordion v-model="sellToolsModel" :items="sellToolsItems" />
            </div>
            <div class="bg-white card flex-grow shadow-default">
                <h3 class="size-30px text-center">Доп. темы</h3>
                <Accordion v-model="additionalThemesModel" :items="additionalThemesItems" />
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
import MBtn from '~/components/buttons/MBtn.vue'

const chips = ['8 часов', '19 тем', 'Теория', 'Практика']

const sellMethodsModel = ref(0)
const sellMethodsItems = ref([
    {
        title: 'Что есть продажи?',
        content:
            'Для того, чтобы продавать, мы должны понимать, что такое продажи. На этом этапе мы будем погружаться в идеологию продаж и как они работают.',
    },
    {
        title: 'Что вы продаете?',
        content:
            'Задавая этот вопрос продавцам, чаще всего можно услышать «мы продаем продукт или услугу», но перед тем, как продать услугу, мы должны совершить еще несколько продаж, без которых продажа продукта невозможно.',
    },
    {
        title: 'Целевая аудитория',
        content:
            'Продавать всем- это миф. Мы должны точно понимать, кому продаем, тогда мы сможем учитывать интересы своего покупателя и благодаря этому делать лучшее предложение.',
    },
    {
        title: 'Воронка продаж',
        content:
            'У любого потенциального клиента есть путь, который ему надо пройти, что купить. Поняв этот путь клиента, мы сможем влиять на его отдельные этапы, повышая вероятность продажи.',
    },
    {
        title: 'Целевой этап воронки продаж',
        content:
            'В воронке продаж есть этап, который дает максимальную конверсию в продажи, здесь мы займемся поиском этой золотой жили.',
    },
    {
        title: 'Ценное конечное предложение',
        content:
            'Что и для чего мы это делаем? У любой должности и компании есть конечный результат, к которому они стремятся. Мы определим результат, к которому стремится каждый отдельный сотрудник.',
    },
    {
        title: 'Уникальное торговое предложение',
        content: 'Здесь мы будем находить то, что вас отличает от конкурентов, а когда найдем, то усилим этот момент.',
    },
    {
        title: 'Точки касаний',
        content:
            'Продажи редко случаются с первого звонка, обычно для этого требуется какое-то время и определенные действия. А какие действия, это мы с вами как раз и разберем.',
    },
    {
        title: 'Метрики',
        content:
            'Когда мы отселживаем показатели, то они начинают автоматически расти, а если к этому приложить анализ и усиление, то результативность выйдет на совсем другой уровень.',
    },
    {
        title: 'Классификация клиентов',
        content:
            'Одинаково взаимодействовать со всеми клиентам- это путь к низкой эффективности и малым продажам. В этой части мы разберем, с какими клиентами работать в первую, с какими во-вторую, а с какими в третью очередь.',
    },
    {
        title: 'Таблица переговоров',
        content:
            'Чтобы предпринять действия, вам надо понять, на каком этапе переговоров вы находитесь, этому мы и будем учиться.',
    },
])

const sellToolsModel = ref(0)
const sellToolsItems = ref([
    {
        title: 'Установление контакта',
        content: 'Нас встречают по одежке, установление контакта, как раз та самая одежка.',
    },
    {
        title: 'Выявление потребностей',
        content: 'Xем больше вам откроются, тем больше вам будут доверять, и вы будете знать, как и что предлагать.',
    },
    {
        title: 'Презентация продукта',
        content:
            'Часто менедеры рассказывают о свойствах, пытаясь блеснуть знаниями- это ошибка, ведь клиент покупает решение, а не ваши показушные знания.',
    },
    {
        title: 'Презентация цены',
        content:
            'Расставаться с деньгами всегда непросто, и вот здесь надо показать, что клиент приобретает гораздо большее, за меньшее.',
    },
    {
        title: 'Работа с возражениями',
        content:
            'В идеале возражение быть не должно, но это в идеале, на деле же они возникают довольно часто и вот тут мы займемся тем, чтобы возражения приносили нам пользу, а не вред.',
    },
    {
        title: 'Завершение сделки',
        content:
            'Этот этап похож на огранку алмаза, одно неверное движение и вы можете потерять все, к чему так долго шли.',
    },
])

const additionalThemesModel = ref(0)
const additionalThemesItems = [
    {
        title: 'Установки влияющие на продажи',
        content: 'Без правильного мышления, максимум, что сможет менеджер- это консультировать, но никак не продавать.',
    },
    {
        title: 'Тренировка голоса',
        content: 'Гораздо приятней слушать красивую мелодию гитары, чем скрежет по металлу.',
    },
]
</script>

<style lang="scss" scoped>
.chip {
    @apply text-white font-medium border-white border-2 rounded-default;
    padding: 4px 10px;
    margin-bottom: 10px;
}
</style>
